{
  "id": "20251206_220757_sample",
  "timestamp": "2025-12-06T22:07:57.472798",
  "original_file": "E:\\ChatBot\\meeting-transcript-chatbot2\\data\\uploads\\sample.txt",
  "summary": "TÓM TẮT:\n\nCuộc họp về Dự án Apollo đã cập nhật tình hình ngân sách và tiến độ. Ngân sách hiện đang tốt, thấp hơn 5% so với dự kiến. Tuy nhiên, phát triển frontend đang chậm một chút nhưng dự kiến sẽ bắt kịp vào tuần tới. Để giải quyết, nhóm quyết định ưu tiên tính năng đăng nhập, và Participant B sẽ điều chỉnh phân bổ nguồn lực để hỗ trợ phát triển frontend. Các hành động chính bao gồm Participant C hoàn thành tính năng đăng nhập và Participant B tái phân bổ nguồn lực.",
  "topics": [
    {
      "topic": "Cập nhật ngân sách",
      "description": "Thành viên B đã cung cấp thông tin cập nhật về ngân sách dự án, cho biết hiện tại dự án đang thấp hơn ngân sách 5%."
    },
    {
      "topic": "Tiến độ dự án",
      "description": "Thảo luận về tiến độ dự án, cụ thể là việc phát triển frontend đang chậm hơn lịch trình một chút nhưng dự kiến sẽ bắt kịp vào tuần tới."
    },
    {
      "topic": "Ưu tiên tính năng",
      "description": "Thành viên A quyết định ưu tiên tính năng đăng nhập (login feature) để đẩy nhanh tiến độ phát triển."
    },
    {
      "topic": "Phân bổ nguồn lực",
      "description": "Thành viên B sẽ điều chỉnh phân bổ nguồn lực để hỗ trợ cho việc phát triển frontend."
    }
  ],
  "action_items": [
    {
      "task": "finish login feature",
      "assignee": "Participant C",
      "deadline": "Chưa xác định"
    },
    {
      "task": "reallocate resources",
      "assignee": "Participant B",
      "deadline": "Chưa xác định"
    }
  ],
  "decisions": [
    {
      "decision": "Ưu tiên tính năng đăng nhập (login feature).",
      "context": "Phát triển frontend đang bị chậm tiến độ nhẹ, và cần tập trung nguồn lực để bắt kịp tiến độ."
    },
    {
      "decision": "Điều chỉnh phân bổ nguồn lực để hỗ trợ phát triển frontend.",
      "context": "Để giúp bắt kịp tiến độ phát triển frontend đang bị chậm và hỗ trợ tính năng đăng nhập đã được ưu tiên."
    }
  ],
  "metadata": {
    "language": "vi",
    "meeting_type": "project",
    "specialized_data": {}
  }
}