{
  "id": "20251129_113327_sample_meeting2",
  "timestamp": "2025-11-29T11:33:27.440584",
  "original_file": "C:\\Users\\Admin\\AppData\\Local\\Temp\\gradio\\29a0211c8dfc17375b19993a8ffe162241718e6b2d684183a0bf6385d0a3549b\\sample_meeting2.txt",
  "summary": "TÓM TẮT:\n\nCuộc họp tập trung thảo luận chiến lược Q4 và lộ trình sản phẩm, với quyết định quan trọng là chấp nhận đề nghị đầu tư 500.000 USD từ TechCorp để đổi lấy 10% cổ phần, nhằm mở rộng thị trường châu Á. Về sản phẩm, ứng dụng di động đang hoàn thiện (iOS sẵn sàng beta, Android cần 2 tuần) và sẽ tích hợp hệ thống đề xuất AI, với mục tiêu ra mắt beta vào 1/12, soft launch 8/12 và chính thức vào 15/12. Ngân sách marketing 200.000 USD được điều chỉnh tăng cho thị trường Việt Nam, đồng thời yêu cầu hoàn thành kiểm tra bảo mật trước 30/11 và tuyển thêm 3 lập trình viên cho nhóm Trung Quốc để đảm bảo tiến độ.",
  "topics": [
    {
      "topic": "Cập nhật Phát triển Sản phẩm",
      "description": "Thảo luận về tiến độ phát triển ứng dụng di động (iOS, Android), tích hợp API cổng thanh toán, kiểm tra bảo mật hệ thống, và quyết định bổ sung hệ thống đề xuất AI. Đồng thời, bàn về việc tuyển thêm 3 lập trình viên cho nhóm Trung Quốc."
    },
    {
      "topic": "Chiến lược Marketing và Ngân sách Q4",
      "description": "Thảo luận về các chiến dịch marketing cho 5 thị trường (USA, Vietnam, China, Spain, Brazil), phân bổ ngân sách tổng cộng $200,000 (sau điều chỉnh thành $210,000 với $40,000 cho Việt Nam và $70,000 cho Mỹ), và kế hoạch hợp tác với 10 người có ảnh hưởng."
    },
    {
      "topic": "Lịch trình Ra mắt Sản phẩm",
      "description": "Đề xuất và thống nhất lịch trình ra mắt sản phẩm bao gồm Beta launch vào 1/12, Soft launch vào 8/12, và Official launch vào 15/12."
    },
    {
      "topic": "Cơ hội Đầu tư và Đối tác",
      "description": "Thảo luận và đưa ra quyết định chấp nhận đề nghị đầu tư từ TechCorp với $500,000 đổi lấy 10% cổ phần, dựa trên mạng lưới và sự hiện diện mạnh mẽ của họ ở châu Á."
    }
  ],
  "action_items": [
    {
      "task": "Complete Android app development",
      "assignee": "Zhang Wei",
      "deadline": "Chưa xác định"
    },
    {
      "task": "Hire 3 developers for China team",
      "assignee": "Zhang Wei",
      "deadline": "December 15th"
    },
    {
      "task": "Hoàn thành security audit",
      "assignee": "Linh",
      "deadline": "30/11"
    },
    {
      "task": "Coordinate beta launch",
      "assignee": "Linh",
      "deadline": "December 1st"
    },
    {
      "task": "Adjust marketing budget (increase Vietnam to $40,000 and reduce USA to $70,000)",
      "assignee": "Maria",
      "deadline": "Chưa xác định"
    },
    {
      "task": "Prepare 3 launch campaigns (for beta, soft launch, and official launch)",
      "assignee": "Maria",
      "deadline": "Chưa xác định"
    },
    {
      "task": "Finalize investment contract with TechCorp",
      "assignee": "David",
      "deadline": "November 25th"
    }
  ],
  "decisions": [
    {
      "decision": "Thêm hệ thống đề xuất AI vào các tính năng sản phẩm.",
      "context": "Hệ thống này dự kiến sẽ tăng mức độ tương tác của người dùng lên 40% theo nghiên cứu."
    },
    {
      "decision": "Phê duyệt tổng ngân sách tiếp thị là 200.000 đô la cho quý 4.",
      "context": "Maria đã chuẩn bị các chiến dịch và đề xuất tổng ngân sách, David nhận thấy là hợp lý."
    },
    {
      "decision": "Điều chỉnh phân bổ ngân sách tiếp thị: tăng ngân sách cho Việt Nam lên 40.000 đô la và giảm ngân sách cho Mỹ xuống 70.000 đô la.",
      "context": "Linh đề xuất tăng ngân sách cho Việt Nam do tiềm năng thị trường lớn và David đã đồng ý với sự điều chỉnh này."
    },
    {
      "decision": "Tuyển dụng thêm 3 nhà phát triển cho đội ngũ tại Trung Quốc.",
      "context": "Zhang Wei đề xuất do khối lượng công việc nặng và cần đẩy nhanh việc phát triển tính năng, David đã chấp thuận."
    },
    {
      "decision": "Phê duyệt lịch trình ra mắt sản phẩm: Beta launch vào ngày 1 tháng 12, Soft launch vào ngày 8 tháng 12 và Official launch vào ngày 15 tháng 12.",
      "context": "Linh đề xuất lịch trình này để có đủ thời gian sửa lỗi và thu thập phản hồi người dùng, tất cả mọi người đều đồng ý."
    },
    {
      "decision": "Chấp nhận đề nghị đầu tư của TechCorp với 500.000 đô la đổi lấy 10% vốn chủ sở hữu.",
      "context": "TechCorp đưa ra đề nghị đầu tư và nhóm (Linh, Zhang Wei) đồng ý rằng đây là một thỏa thuận tốt hơn do mạng lưới rộng khắp của TechCorp ở châu Á, giúp mở rộng nhanh hơn."
    }
  ],
  "metadata": {
    "language": "vi",
    "meeting_type": "meeting",
    "specialized_data": {}
  }
}