{
  "id": "20251129_114250_sample_meeting",
  "timestamp": "2025-11-29T11:42:50.466949",
  "original_file": "C:\\Users\\Admin\\AppData\\Local\\Temp\\gradio\\79485c5c0cce4ba9f3ea07e5c88cf55ec73fd959b25b3598b3295db560f8f331\\sample_meeting.txt",
  "summary": "TÓM TẮT:\n\nCuộc họp dự án website thương mại điện tử đã cập nhật tiến độ và lên kế hoạch cho sprint tiếp theo. Team quyết định đổi màu chủ đạo của website sang xanh lá cây, và Mai sẽ cập nhật thiết kế trước thứ Tư. Tuấn (Developer) cam kết hoàn thành authentication cuối tuần này và tích hợp cổng thanh toán trước 22/11. Linh (Marketing) sẽ đàm phán giảm ngân sách marketing xuống 35 triệu và chuẩn bị hai chiến dịch cho soft launch vào 1/12 và official launch vào 8/12.",
  "topics": [
    {
      "topic": "Cập nhật thiết kế UI/UX",
      "description": "Thảo luận về việc hoàn thành thiết kế UI cho trang chủ, trang sản phẩm và trang giỏ hàng. Quyết định thay đổi màu chủ đạo của website từ xanh dương sang xanh lá để phù hợp với thương hiệu và concept eco-friendly."
    },
    {
      "topic": "Tiến độ phát triển kỹ thuật",
      "description": "Báo cáo tiến độ hoàn thành 80% backend API, đang thực hiện authentication và authorization. Thảo luận về vấn đề tích hợp cổng thanh toán (payment gateway) do tài liệu không rõ ràng và tiến độ frontend đang chờ thiết kế cuối cùng."
    },
    {
      "topic": "Kế hoạch và ngân sách Marketing",
      "description": "Cập nhật về kế hoạch nội dung (20 bài blog, 50 posts social media) và việc liên hệ 5 influencers. Thảo luận và thống nhất giảm ngân sách marketing từ 50 triệu xuống 35 triệu cho 3 tháng đầu, yêu cầu Linh đàm phán lại hoặc giảm số lượng influencers."
    },
    {
      "topic": "Lịch ra mắt sản phẩm",
      "description": "Thảo luận và thống nhất về lịch ra mắt sản phẩm: soft launch vào ngày 1/12 cho nhóm beta users và official launch vào ngày 8/12, có thêm 1 tuần đệm cho việc kiểm thử."
    }
  ],
  "action_items": [
    {
      "task": "Cập nhật lại design UI với màu xanh lá mới và gửi lại cho team",
      "assignee": "Mai",
      "deadline": "trước thứ Tư"
    },
    {
      "task": "Hoàn thành authentication",
      "assignee": "Tuấn",
      "deadline": "cuối tuần này"
    },
    {
      "task": "Hoàn thành payment integration",
      "assignee": "Tuấn",
      "deadline": "trước 22/11"
    },
    {
      "task": "Negotiate budget marketing xuống 35 triệu",
      "assignee": "Linh",
      "deadline": "Chưa xác định"
    },
    {
      "task": "Chuẩn bị 2 launch campaigns (cho soft launch và official launch)",
      "assignee": "Linh",
      "deadline": "Chưa xác định"
    }
  ],
  "decisions": [
    {
      "decision": "Đổi màu chủ đạo của website từ xanh dương sang xanh lá.",
      "context": "Để phù hợp hơn với thương hiệu và concept eco-friendly, tạo sự khác biệt so với các đối thủ cạnh tranh. Mai sẽ cập nhật thiết kế với màu mới và gửi lại cho team trước thứ Tư tuần này."
    },
    {
      "decision": "Hoàn thành tích hợp cổng thanh toán (payment integration) trước ngày 22/11.",
      "context": "Tuấn gặp vấn đề với tài liệu của nhà cung cấp cổng thanh toán không rõ ràng và cần thêm thời gian để nghiên cứu, kiểm thử."
    },
    {
      "decision": "Thiết lập các ưu tiên công việc phát triển cho Tuấn trong tuần này.",
      "context": "Các ưu tiên bao gồm: 1) Hoàn thành authentication, 2) Tích hợp cổng thanh toán, 3) Triển khai frontend sau khi có thiết kế mới."
    },
    {
      "decision": "Ngân sách marketing cho 3 tháng đầu sẽ là 35 triệu đồng.",
      "context": "Ngân sách đề xuất ban đầu là 50 triệu được đánh giá là hơi cao. Linh sẽ thương lượng với influencers hoặc giảm số lượng influencers để đạt mức ngân sách này."
    },
    {
      "decision": "Lịch ra mắt dự án được chia thành hai giai đoạn.",
      "context": "Soft launch sẽ diễn ra vào ngày 01/12 cho một nhóm người dùng beta, và official launch vào ngày 08/12 để có thêm 1 tuần đệm cho việc thử nghiệm."
    }
  ],
  "metadata": {
    "language": "vi",
    "meeting_type": "meeting",
    "specialized_data": {}
  }
}