{
  "id": "20251127_232920_sample_meeting",
  "timestamp": "2025-11-27T23:29:20.194734",
  "original_file": "C:\\Users\\Admin\\AppData\\Local\\Temp\\gradio\\79485c5c0cce4ba9f3ea07e5c88cf55ec73fd959b25b3598b3295db560f8f331\\sample_meeting.txt",
  "summary": "TÓM TẮT:\n\nCuộc họp dự án website thương mại điện tử đã tập trung vào việc đánh giá tiến độ và lên kế hoạch cho sprint tiếp theo, bao gồm các cập nhật về thiết kế, phát triển và marketing. Các quyết định chính bao gồm đổi màu chủ đạo UI sang xanh lá cây, hoàn thành authentication và tích hợp thanh toán (Tuấn), cùng với việc Linh sẽ đàm phán giảm ngân sách marketing xuống 35 triệu và chuẩn bị hai chiến dịch. Dự án sẽ có soft launch vào ngày 1/12 và official launch vào ngày 8/12, với các nhiệm vụ cụ thể được giao cho từng thành viên.",
  "topics": [
    {
      "topic": "Cập nhật và Thay đổi Thiết kế UI",
      "description": "Thảo luận về tiến độ thiết kế UI (trang chủ, sản phẩm, giỏ hàng) và quyết định thay đổi màu chủ đạo của website từ xanh dương sang xanh lá để phù hợp với thương hiệu và tạo sự khác biệt."
    },
    {
      "topic": "Tiến độ Phát triển & Vấn đề Kỹ thuật",
      "description": "Cập nhật tiến độ hoàn thành backend API (80%), đang thực hiện authentication và authorization. Nêu ra vấn đề với việc tích hợp cổng thanh toán do tài liệu không rõ ràng và cần thêm thời gian. Thảo luận về tiến độ frontend (50%) và sự phụ thuộc vào thiết kế cuối cùng."
    },
    {
      "topic": "Kế hoạch và Ngân sách Marketing",
      "description": "Trình bày kế hoạch nội dung (blog, social media) và việc liên hệ với influencers. Thảo luận về ngân sách influencer marketing, với đề xuất ban đầu 50 triệu và quyết định cuối cùng là 35 triệu sau khi đàm phán."
    },
    {
      "topic": "Chiến lược và Thời gian Ra mắt Dự án",
      "description": "Thảo luận về ngày ra mắt dự kiến (1/12), cân nhắc thêm thời gian buffer cho việc kiểm thử. Quyết định chia thành soft launch vào 1/12 cho nhóm beta users và official launch vào 8/12."
    }
  ],
  "action_items": [
    {
      "task": "Cập nhật design với màu xanh lá mới và gửi lại cho team",
      "assignee": "Mai",
      "deadline": "Trước thứ Tư"
    },
    {
      "task": "Hoàn thành authentication",
      "assignee": "Tuấn",
      "deadline": "Cuối tuần này"
    },
    {
      "task": "Hoàn thành payment integration",
      "assignee": "Tuấn",
      "deadline": "Trước ngày 22/11"
    },
    {
      "task": "Implement frontend",
      "assignee": "Tuấn",
      "deadline": "Chưa xác định"
    },
    {
      "task": "Negotiate lại với influencers để giảm budget xuống 35 triệu",
      "assignee": "Linh",
      "deadline": "Chưa xác định"
    },
    {
      "task": "Chuẩn bị 2 campaigns riêng cho soft launch và official launch",
      "assignee": "Linh",
      "deadline": "Chưa xác định"
    }
  ],
  "decisions": [
    {
      "decision": "Đổi màu chủ đạo của website từ xanh dương sang xanh lá.",
      "context": "Để phù hợp hơn với thương hiệu và tạo sự khác biệt so với các đối thủ cạnh tranh. Đề xuất này được Mai đưa ra và được cả team đồng ý."
    },
    {
      "decision": "Tuấn phải hoàn thành payment integration trước ngày 22/11.",
      "context": "Tuấn gặp vấn đề với documentation của payment provider và cần thêm thời gian để research và test."
    },
    {
      "decision": "Thiết lập các ưu tiên công việc cho Tuấn trong tuần này: 1) Hoàn thành authentication, 2) Payment integration, 3) Frontend implementation sau khi có design mới.",
      "context": "Để đảm bảo tiến độ công việc development của Tuấn."
    },
    {
      "decision": "Giảm ngân sách marketing cho 3 tháng đầu từ 50 triệu xuống 35 triệu.",
      "context": "Ngân sách 50 triệu được đánh giá là hơi cao. Linh sẽ thử negotiate lại với influencers hoặc giảm số lượng influencers để đạt được mức ngân sách này."
    },
    {
      "decision": "Thiết lập hai giai đoạn ra mắt sản phẩm: Soft launch vào 1/12 cho nhóm beta users và Official launch vào 8/12.",
      "context": "Để có thêm 1 tuần buffer cho testing nhằm đảm bảo chất lượng trước khi ra mắt chính thức."
    }
  ],
  "metadata": {
    "language": "vi",
    "meeting_type": "meeting"
  }
}