{
  "id": "20251206_024701_sample_meeting2",
  "timestamp": "2025-12-06T02:47:01.167969",
  "original_file": "sample_meeting2.txt",
  "summary": "TÓM TẮT:\n\nCuộc họp chiến lược Q4 của Global Tech Startup đã tập trung vào lộ trình sản phẩm và kế hoạch ra mắt. Ứng dụng di động đã hoàn thành 75% và tích hợp API backend sẵn sàng cho kiểm thử bảo mật, đồng thời sẽ bổ sung hệ thống đề xuất AI và tuyển thêm 3 lập trình viên. Ngân sách marketing Q4 được chốt ở mức 200.000 USD (trong đó tăng ngân sách cho thị trường Việt Nam), và lịch trình ra mắt sản phẩm được ấn định vào ngày 1/12 (beta), 8/12 (soft launch) và 15/12 (official launch). Cuối cùng, công ty đã chấp nhận khoản đầu tư 500.000 USD từ TechCorp.",
  "topics": [
    {
      "topic": "Phát triển Sản phẩm & Tính năng",
      "description": "Thảo luận về tiến độ phát triển ứng dụng di động (iOS sẵn sàng beta, Android cần 2 tuần nữa), tích hợp API backend và kiểm tra bảo mật, bổ sung hệ thống đề xuất AI, và đề xuất tuyển dụng thêm 3 nhà phát triển cho nhóm Trung Quốc."
    },
    {
      "topic": "Chiến lược & Ngân sách Marketing",
      "description": "Bàn bạc về các chiến dịch marketing cho 5 thị trường (Mỹ, Việt Nam, Trung Quốc, Tây Ban Nha, Brazil) với tổng ngân sách ban đầu là $200,000, điều chỉnh ngân sách cho thị trường Việt Nam lên $40,000, và kế hoạch hợp tác với 10 người ảnh hưởng."
    },
    {
      "topic": "Lịch trình Ra mắt Sản phẩm",
      "description": "Thống nhất lịch trình ra mắt sản phẩm: Beta launch vào ngày 1/12, Soft launch vào ngày 8/12, và Official launch vào ngày 15/12 để có đủ thời gian sửa lỗi và thu thập phản hồi người dùng."
    },
    {
      "topic": "Cơ hội Đầu tư & Hợp tác",
      "description": "Đánh giá các đề xuất đầu tư từ TechCorp ($500,000 cho 10% cổ phần) và InnovateLabs, và quyết định chấp nhận đề nghị của TechCorp do lợi thế mạng lưới rộng ở châu Á."
    }
  ],
  "action_items": [
    {
      "task": "Hoàn thành phát triển ứng dụng Android.",
      "assignee": "Zhang Wei",
      "deadline": "Chưa xác định"
    },
    {
      "task": "Làm việc với HR để tuyển dụng 3 nhà phát triển cho đội Trung Quốc.",
      "assignee": "Zhang Wei",
      "deadline": "December 15th"
    },
    {
      "task": "Hoàn thành kiểm toán bảo mật (security audit).",
      "assignee": "Linh",
      "deadline": "30/11"
    },
    {
      "task": "Điều phối đợt ra mắt thử nghiệm (beta launch).",
      "assignee": "Linh",
      "deadline": "Chưa xác định"
    },
    {
      "task": "Điều chỉnh ngân sách tiếp thị (tăng ngân sách Việt Nam lên $40,000 và giảm ngân sách Mỹ xuống $70,000).",
      "assignee": "Maria",
      "deadline": "Chưa xác định"
    },
    {
      "task": "Chuẩn bị 3 chiến dịch riêng biệt cho beta, soft launch và official launch.",
      "assignee": "Maria",
      "deadline": "Chưa xác định"
    },
    {
      "task": "Hợp tác với 10 người có ảnh hưởng (influencers) trên các thị trường đã chọn.",
      "assignee": "Maria",
      "deadline": "Chưa xác định"
    },
    {
      "task": "Hoàn tất hợp đồng đầu tư với TechCorp.",
      "assignee": "David",
      "deadline": "November 25th"
    }
  ],
  "decisions": [
    {
      "decision": "Thêm hệ thống đề xuất được hỗ trợ bởi AI vào các tính năng của sản phẩm.",
      "context": "Để tăng mức độ tương tác của người dùng lên 40% theo nghiên cứu."
    },
    {
      "decision": "Phê duyệt tổng ngân sách tiếp thị là 200.000 USD cho Q4.",
      "context": "Để triển khai các chiến dịch tại 5 thị trường khác nhau: Mỹ, Việt Nam, Trung Quốc, Tây Ban Nha và Brazil."
    },
    {
      "decision": "Điều chỉnh phân bổ ngân sách tiếp thị bằng cách tăng ngân sách cho Việt Nam lên 40.000 USD và giảm ngân sách cho Mỹ xuống 70.000 USD.",
      "context": "Dựa trên đề xuất của Linh do tiềm năng lớn và tốc độ tăng trưởng nhanh của thị trường Việt Nam, đặc biệt trong lĩnh vực thanh toán di động."
    },
    {
      "decision": "Thuê thêm 3 nhà phát triển cho đội ngũ Trung Quốc trước ngày 15 tháng 12.",
      "context": "Để giải quyết khối lượng công việc nặng nề và đẩy nhanh việc triển khai các tính năng."
    },
    {
      "decision": "Phê duyệt lịch trình ra mắt sản phẩm: Beta launch vào ngày 1 tháng 12, Soft launch vào ngày 8 tháng 12 và Official launch vào ngày 15 tháng 12.",
      "context": "Để có đủ thời gian sửa lỗi và thu thập phản hồi từ người dùng."
    },
    {
      "decision": "Chấp nhận đề nghị đầu tư của TechCorp trị giá 500.000 USD cho 10% vốn chủ sở hữu.",
      "context": "TechCorp có mạng lưới rộng khắp và sự hiện diện mạnh mẽ ở châu Á (Trung Quốc và Đông Nam Á), có thể giúp công ty mở rộng nhanh hơn tại các thị trường châu Á. David sẽ hoàn tất hợp đồng trước ngày 25 tháng 11."
    }
  ],
  "metadata": {
    "language": "vi",
    "meeting_type": "meeting",
    "file_type": "text",
    "speaker_diarization": true,
    "specialized_data": {}
  }
}