{
  "id": "20251206_220433_sample",
  "timestamp": "2025-12-06T22:04:33.637089",
  "original_file": "E:\\ChatBot\\meeting-transcript-chatbot2\\data\\uploads\\sample.txt",
  "summary": "TÓM TẮT:\n\nMục đích cuộc họp về Dự án Apollo là cập nhật tình hình và đưa ra các quyết định cần thiết. Về ngân sách, dự án đang chi tiêu thấp hơn 5% so với kế hoạch, nhưng tiến độ phát triển frontend đang hơi chậm. Để khắc phục, nhóm quyết định ưu tiên hoàn thành tính năng đăng nhập và điều chỉnh phân bổ nguồn lực để hỗ trợ phát triển frontend. Các hành động cụ thể bao gồm Participant C hoàn thành tính năng đăng nhập và Participant B điều chỉnh nguồn lực.",
  "topics": [
    {
      "topic": "Tình hình Ngân sách",
      "description": "Thảo luận về tình hình ngân sách hiện tại của dự án, với thông tin dự án đang vượt ngân sách 5%."
    },
    {
      "topic": "Tiến độ & Lịch trình Dự án",
      "description": "Đánh giá tiến độ dự án, đặc biệt là tình trạng phát triển frontend đang bị chậm trễ nhẹ so với kế hoạch."
    },
    {
      "topic": "Ưu tiên Tính năng & Phân bổ Nguồn lực",
      "description": "Quyết định ưu tiên phát triển tính năng đăng nhập và điều chỉnh phân bổ nguồn lực để hỗ trợ đẩy nhanh tiến độ frontend."
    }
  ],
  "action_items": [
    {
      "task": "finish login feature",
      "assignee": "Participant C",
      "deadline": "Chưa xác định"
    },
    {
      "task": "reallocate resources",
      "assignee": "Participant B",
      "deadline": "Chưa xác định"
    }
  ],
  "decisions": [
    {
      "decision": "Ưu tiên tính năng đăng nhập (login feature).",
      "context": "Đội ngũ đang bị chậm tiến độ một chút trong phát triển frontend, và Participant A quyết định ưu tiên tính năng đăng nhập để khắc phục tình trạng này."
    },
    {
      "decision": "Điều chỉnh phân bổ nguồn lực để hỗ trợ phát triển frontend.",
      "context": "Sau quyết định ưu tiên tính năng đăng nhập và tình hình chậm trễ chung trong phát triển frontend, Participant B quyết định điều chỉnh nguồn lực để hỗ trợ công việc frontend."
    }
  ],
  "metadata": {
    "language": "vi",
    "meeting_type": "project",
    "specialized_data": {}
  }
}