{
  "id": "20251124_012054_sample_meeting2",
  "timestamp": "2025-11-24T01:20:54.874181",
  "original_file": "C:\\Users\\Admin\\AppData\\Local\\Temp\\gradio\\29a0211c8dfc17375b19993a8ffe162241718e6b2d684183a0bf6385d0a3549b\\sample_meeting2.txt",
  "summary": "The Global Tech Startup meeting focused on finalizing the Q4 strategy and product roadmap, encompassing product development, marketing plans, and strategic partnerships. Key updates included completing 75% of mobile app development with an AI-powered recommendation system, and a security audit for API integration to be done by November 30th. The team established a launch timeline for December 1st (beta), December 8th (soft), and December 15th (official release), while adjusting the $200,000 marketing budget to increase Vietnam's allocation and approving the hiring of three new developers for the China team. Crucially, the company decided to accept TechCorp's investment offer of $500,000 for 10% equity, with the contract set to be finalized by November 25th.",
  "topics": [
    {
      "topic": "Product Development & Launch Plan",
      "description": "Discussion on the progress of mobile app development (iOS ready for beta, Android needs two more weeks), backend API integration, and security audit completion. The team also decided to add an AI-powered recommendation system. A launch timeline was set: Beta launch on December 1st, soft launch on December 8th, and official launch on December 15th."
    },
    {
      "topic": "Q4 Marketing Strategy & Budget",
      "description": "Maria presented Q4 marketing campaigns for 5 markets (USA, Vietnam, China, Spain, Brazil) with an initial total budget of $200,000. The budget was adjusted to increase Vietnam's allocation to $40,000 and decrease USA's to $70,000. Plans for collaborating with 10 influencers were also discussed."
    },
    {
      "topic": "Strategic Investment & Partnerships",
      "description": "Discussion regarding investment offers from TechCorp ($500,000 for 10% equity) and InnovateLabs ($300,000 for 8% equity). The team decided to accept TechCorp's offer due to their strong network in Asian markets, with David finalizing the contract by November 25th."
    },
    {
      "topic": "Team Expansion for China",
      "description": "Zhang Wei proposed hiring 3 additional developers for the China team to manage the heavy workload and accelerate feature delivery. The proposal was approved, with hiring to be completed by December 15th."
    }
  ],
  "action_items": [
    {
      "task": "Complete Android app development",
      "assignee": "Zhang Wei",
      "deadline": "Not specified"
    },
    {
      "task": "Hire 3 developers for China team",
      "assignee": "Zhang Wei",
      "deadline": "December 15th"
    },
    {
      "task": "Complete security audit",
      "assignee": "Linh",
      "deadline": "November 30th"
    },
    {
      "task": "Coordinate beta launch",
      "assignee": "Linh",
      "deadline": "December 1st"
    },
    {
      "task": "Adjust marketing budget",
      "assignee": "Maria",
      "deadline": "Not specified"
    },
    {
      "task": "Prepare 3 launch campaigns (for beta, soft launch, and official launch)",
      "assignee": "Maria",
      "deadline": "Before respective launch dates"
    },
    {
      "task": "Finalize investment contract with TechCorp",
      "assignee": "David",
      "deadline": "November 25th"
    }
  ],
  "decisions": [
    {
      "decision": "Approve the Q4 marketing total budget of $200,000.",
      "context": "Maria proposed this budget for marketing campaigns across 5 different markets (USA, Vietnam, China, Spain, and Brazil)."
    },
    {
      "decision": "Adjust the Q4 marketing budget allocation by increasing Vietnam's budget to $40,000 and reducing USA's budget to $70,000.",
      "context": "Linh suggested increasing Vietnam's budget due to its high potential and fast growth in the mobile payment sector."
    },
    {
      "decision": "Hire 3 additional developers for the China team by December 15th.",
      "context": "Zhang Wei proposed this to address heavy workload and accelerate feature delivery."
    },
    {
      "decision": "Complete a security audit before November 30th to ensure all vulnerabilities are addressed.",
      "context": "David emphasized security as a top priority before the product launch, and Linh committed to conducting the audit by the specified date."
    },
    {
      "decision": "Establish the product launch timeline: Beta launch on December 1st, soft launch on December 8th, and official launch on December 15th.",
      "context": "Linh proposed this timeline to allow sufficient time for bug fixing and gathering user feedback, and it was agreed upon by all participants."
    },
    {
      "decision": "Accept TechCorp's investment offer of $500,000 for 10% equity.",
      "context": "TechCorp was chosen over InnovateLabs due to its extensive network and strong presence in Asian markets, which is expected to facilitate faster expansion."
    }
  ],
  "metadata": {
    "language": "en",
    "meeting_type": "meeting"
  }
}