{
  "id": "20251129_030602_meeting_regular",
  "timestamp": "2025-11-29T03:06:02.147811",
  "original_file": "data\\transcripts\\meeting_regular.txt",
  "summary": "TÓM TẮT:\n\nCuộc họp đồng bộ hàng tuần của nhóm Phát triển Sản phẩm đã cập nhật tiến độ tích hợp OAuth (đang kiểm thử, có lỗi bảo mật), hoàn thành thiết kế dashboard và phát hiện 3 lỗi nghiêm trọng ở cổng thanh toán. Các chủ đề chính được thảo luận bao gồm tiến độ phát hành Q4, yêu cầu tính năng mới và vấn đề hiệu suất dashboard. Nhóm đã quyết định dời ngày phát hành Q4 sang 15/12 để có thêm thời gian kiểm thử, phê duyệt ngân sách cho nhân sự QA bổ sung và hoãn hệ thống giới thiệu đến Q1/2026. Các ưu tiên hành động ngay là khắc phục 3 lỗi thanh toán, tối ưu hóa thời gian tải dashboard và tuyển thêm kỹ sư QA.",
  "topics": [
    {
      "topic": "Tiến độ Phát hành Q4",
      "description": "Thảo luận về tiến độ phát hành Quý 4, nhận thấy cần tăng tốc thử nghiệm và quyết định dời ngày phát hành sang 15/12 để có thêm thời gian kiểm tra và sửa lỗi."
    },
    {
      "topic": "Yêu cầu Tính năng Mới",
      "description": "Xem xét các yêu cầu tính năng mới, đặc biệt là hệ thống giới thiệu từ Marketing, và quyết định hoãn lại đến Q1 2026 để ưu tiên các tính năng cốt lõi."
    },
    {
      "topic": "Vấn đề Hiệu suất",
      "description": "Thảo luận về vấn đề hiệu suất, cụ thể là thời gian tải trang tổng quan chậm (5 giây), và lên kế hoạch tối ưu hóa để đạt dưới 2 giây."
    }
  ],
  "action_items": [
    {
      "task": "Share the Figma link",
      "assignee": "Mike",
      "deadline": "Chưa xác định"
    },
    {
      "task": "Prioritize 3 critical payment bugs",
      "assignee": "Sarah",
      "deadline": "Chưa xác định"
    },
    {
      "task": "Fix 3 critical payment bugs",
      "assignee": "Sarah",
      "deadline": "01/12/2025"
    },
    {
      "task": "Review dashboard designs and provide feedback",
      "assignee": "John",
      "deadline": "30/11/2025"
    },
    {
      "task": "Hire 2 additional QA engineers",
      "assignee": "Lisa",
      "deadline": "15/12/2025"
    },
    {
      "task": "Optimize dashboard loading time to under 2 seconds",
      "assignee": "Mike",
      "deadline": "05/12/2025"
    },
    {
      "task": "Prepare Q4 release notes and documentation",
      "assignee": "John",
      "deadline": "10/12/2025"
    }
  ],
  "decisions": [
    {
      "decision": "Dời ngày phát hành Q4 sang ngày 15 tháng 12 thay vì ngày 10 tháng 12",
      "context": "Cần thêm thời gian để kiểm tra kỹ lưỡng và sửa lỗi"
    },
    {
      "decision": "Phê duyệt ngân sách cho các nguồn lực QA bổ sung",
      "context": "Đội ngũ hiện tại đang quá tải với khối lượng công việc kiểm thử"
    },
    {
      "decision": "Hoãn hệ thống giới thiệu sang Q1 2026",
      "context": "Tập trung vào các tính năng cốt lõi trước, hệ thống giới thiệu là tính năng không bắt buộc"
    }
  ],
  "metadata": {
    "language": "vi",
    "meeting_type": "meeting",
    "specialized_data": {}
  }
}